[
  {
    "title": "Stargazing",
    "base_version": "After an exhausting week at work, John went star gazing. While doing that,he saw a star growing bigger and bigger, coming straight for him, and said:",
    "detailed_version": "After an exhausting week at work, John decided to partake in his favorite hobby: star gazing.Star gazing was always a relaxing activity for John, and he enjoyed the peace and quiet it brought.No matter how stressful his week was, star gazing always managed to calm him down and give him the energy he needed to face the next week. However, this time was different. As John was looking at the stars, he saw a star that was growing bigger and bigger. It was coming straight for him!Seeing that, John said:",
    "novel_version": "John had been working hard all week, and he was exhausted. He decided to go star gazing, as it was his favorite hobby. Star gazing was always a relaxing activity for John, and he enjoyed the peace and quiet it brought.No matter how stressful his week was, no matter how exhausted he was, looking at the cosmos above always managed to calm him down. The sense of scale, the beauty of the stars, the knowledge that in the grand scheme of things his problems insignificant - all of that gave him the peace of mind he needed to refresh himself and face the next week.This week, just like every other week, John went to his favorite spot to admire the stars.Their scintillating beauty as they hung overhead like smelter pots, dotting the night sky with their glowing presence, was always a sight to behold. the countless stars, the infinite cosmos, the vastness of space - looking at all of that always made John feel like he was part of something bigger and filled him with a sense of awe and wonder, as well as inner peace.However, while John was looking at the stars, he saw a star that was growing bigger and bigger.Not only that, it seemed to be coming straight for him!Seeing that, John said:",
    "possible_remarks": [
      [
        "Looks like I forgot to take my pills again.",
        false,
        "John may actually be taking pills on a regular basis but forgot to take them today, which would explain this absurd situation"
      ],
      [
        "Well, guess getting squashed by a meteor is not the worst way to die",
        false,
        "John is simply accepting his fate, because there is no outrunning a meteor"
      ],
      [
        "Oh great, I wanted to die today anyways.",
        true,
        "Humans do not typically want to die, and there is no indication that John is suicidal"
      ],
      [
        "What the hell is that?",
        false,
        "John is confused and scared, which is probably a normal reaction upon seeing a meteor coming straight for you"
      ]
    ],
    "sarcastic_index": -1
  },
  {
    "title": "Groceries",
    "base_version": "Coming home from picking up groceries, John entered the living room and saw his roommate, Jane.Seeing what she was doing, he said:",
    "detailed_version": "John went to pick up some groceries for himself and his roommate, Jane, which took him a while.When he came back home, as he headed to the living room, he heard some noises coming from there.Knowing his roommate, he braced himself for the worst and entered the living room.When he saw what she was doing, he said:",
    "novel_version": "John had been out to pick up some groceries for himself and his roommate, Jane.It was a long and arduous task, leading to an epic saga of survival, perseverance, determination,a battle against the elements and against human nature itself, but he achieved victory nonetheless and came back home with the groceries.Following his triumphant return, he opened the entryway door,and as he did so, he heard some noises coming from the living room.John knew his roommate, Jane, and he knew that whatever she was doing, it was going to truly be something.And so, taking deep breaths and bracing himself for the worst, he entered the living room.Upon entering the living room and seeing what Jane was doing, he said:",
    "possible_remarks": [
      [
        "That looks fun, mind if I join you?",
        false,
        "John is simply asking if he can join Jane in whatever she is doing"
      ],
      [
        "Mind helping me with the groceries?",
        false,
        "John is asking Jane to help him with the groceries, which is a normal thing to ask of a roommate. Whatever Jane was doing is irrelevant in this context"
      ],
      [
        "Why are you always like this?",
        false,
        "John is exasperated with Jane's behavior, which seems to be a recurring issue,but it is not necessarily a sarcastic remark"
      ],
      [
        "So, did I forget to take my pills today, or did you?",
        true,
        "John is implying that whatever Jane is doing, it is so absurd that it makes him question either his own sanity or hers"
      ]
    ],
    "sarcastic_index": -1
  },
  {
    "title": "A smoothie",
    "base_version": "Opening the door to his apartment, John saw Jane holding a drink in her hand, with an ostrich standing next to her. He asked her whatcha got there?, to which she answered:",
    "detailed_version": "\n        Coming back home from work, John was about to open the door to his apartment when he heard a strange noise coming from inside.\n        He opened the door and saw Jane standing there, holding a drink in her hand. Next to her was an ostrich.\n        John was taken aback by the sight, wondering both what was going on, and just how an ostrich ended up in his apartment.\n        He asked Jane, \"Whatcha got there?\" to which she answered:\n    ",
    "novel_version": "\n        John had just come back from a long day at work, and he was looking forward to relaxing at home.\n        However, as he was about to open the door to his apartment, he heard a strange noise coming from inside.\n        As he knows his roommate Jane well at this point, he immediately realized something was up, and thought to himself\n        'just what is that lunatic up to now?'.\n        As creaked the door open, he first saw an ordinary sight - Jane standing there, holding a drink in her hand.\n        However, as he opened the door further, he saw something that made him do a double take - an ostrich was standing next to her.\n        John was taken aback by the sight, wondering both what was going on, and just how an ostrich ended up in his apartment.\n        Not only that, the ostrich seemed perfectly at home, as if it had been living there for years.\n        He knew that Jane was a bit eccentric, but this was a whole new level of weirdness.\n        Trying to start figuring out what was going on, he asked Jane, \"Whatcha got there?\" to which she answered:\n        ",
    "possible_remarks": [
      [
        "A smoothie.",
        false,
        "This is both a simple and plausibleanswer, as well as a reference to a popular meme"
      ],
      [
        "An ostrich.",
        false,
        "This is a simple and straightforwardanswer"
      ],
      [
        "Definitely not an ostrich.",
        true,
        "This is a sarcastic answer,as there is clearly an ostrich standing next to Jane"
      ],
      [
        "A drink, want some?",
        false,
        "This is a simple and straightforward, likely from misunderstanding the question"
      ]
    ],
    "sarcastic_index": -1
  },
  {
    "title": "Cake",
    "base_version": "After coming back home from an exhausting day at work, John wanted to eat the piece of cake he had saved. However, he found his roommate Jane eating it. He said to her:",
    "detailed_version": "\n        Yesterday, John left a piece of cake in the fridge, which he clearly marked with his name.\n        He was looking forward to eating it after a long day at work, as a reward for his hard work.\n        However, when he came back home, he found his roommate Jane eating it.\n        He was taken aback by the sight, as he clearly marked the cake as his own.\n        This was not the first time this had happened, and he was pretty upset about it.\n        He looked at Jane and said:\n    ",
    "novel_version": "\n        Just yesterday, John left a piece of cake in the fridge, which he clearly marked with his name.\n        The cake was a delectable and mouth-watering 3 layer chocolate cake, with a rich and creamy frosting, \n        sprinkled with chocolate shavings on top and filled with a luscious raspberry filling.\n        He fantasized about it all day at work, and it was the only thing that kept him going through the long and\n        arduous day.\n        He was looking forward to savoring every bite of it, as a reward for his hard work and dedication.\n        Finally coming back home after a long and exhausting day, he opened the fridge with eager anticipation,\n        only to find the cake missing.\n        He went to his roommate Jane's room, where he found her eating the cake.\n        John was absolutely flabbergasted by the sight, as he clearly marked the cake as his own.\n        This was not the first time Jane had eaten his food without permission, and he was fed up with it.\n        He looked at Jane with a mixture of disbelief and anger and said:\n        ",
    "possible_remarks": [
      [
        "I wanted to eat that",
        false,
        "This is a simple and straightforwardthing to say in this situation"
      ],
      [
        "Oh sure, enjoy, I didn't want it anyways",
        true,
        "John is being sarcastic here, as he clearly wanted the cake"
      ],
      [
        "Oh come on, I even put my name on this!",
        false,
        "John is trying to remind Janeto not eat his food by pointing out that he marked it"
      ],
      [
        "You wretched thief, may you and your lineage be cursed for all eternity. May you burn in the fiery pits of hell for your sins, and may you never find peace or happinessin this life or the next",
        false,
        "This is clearly an overreaction forcomedic effect, although not necessarily sarcastic"
      ]
    ],
    "sarcastic_index": -1
  },
  {
    "title": "London rain",
    "base_version": "Going down London's streets, John was suddenly pelted by drops of water. He looked up and thought:",
    "detailed_version": "\n        After a visit to the hair salon, John was walking down the streets of London.\n        Looking up at the sky, he saw dark clouds gathering, and before he knew it, he was pelted by drops of water.\n        The rain was coming down hard, and John thought to himself:\n    ",
    "novel_version": "\n        Knowing that he has a big and important event coming up in the evening, John decided to visit the hair salon \n        to get his hair done.\n        He wanted to look his best for the event, and he knew that a good haircut could make all\n        the difference.\n        After the visit, as he had some time to spare, he decided to take the scenic route back home, walking down the\n        streets of London.\n        The city was bustling with life, and the people were going about their business as usual.\n        However, as John was walking, he noticed dark clouds gathering in the sky.\n        Then, before he knew it, he was pelted by drops of water.\n        The rain was coming down hard, and John thought to himself:\n        ",
    "possible_remarks": [
      [
        "Oh, great, I just got my hair done.",
        false,
        "John is concerned about his hair, which is a common concern for many people"
      ],
      [
        "Oh, never could have seen that coming.",
        true,
        "London is known for its unpredictable weather, where it can rain at any moment"
      ],
      [
        "Oh no, I forgot my laundry outside.",
        false,
        "John is concerned about his laundry, which is a common thing to worry about when it starts raining unexpectedly"
      ],
      [
        "I'm sure Jane would love this.",
        false,
        "John is thinking about Jane, who might like the rain and therefore this situation"
      ]
    ],
    "sarcastic_index": -1
  },
  {
    "title": "Rescuing the princess from the dragon",
    "base_version": "Hunting down the dragon that is thought to have kidnapped the princess, the knight finally reached the dragon's castle. The knight condemned the dragon for his crime, to which the dragon responded:",
    "detailed_version": "\n    The knight had been on a quest to rescue the princess for weeks now.\n    He had faced many challenges and fought many battles, but he had finally reached the castle where the \n    dragon who was said to have kidnapped the princess lived.\n    Upon entering the castle and confronting the dragon, the knight condemned the dragon for his crime.\n    The dragon, however, responded in a way that the knight did not expect, saying:\n    ",
    "novel_version": "\n        A tragedy had befallen the kingdom. The princess had been kidnapped by a fearsome dragon, and the king had\n        dispatched his bravest and mightiest knight to rescue her.\n        The knight had faced many dangers and perils on his journey, overcoming countless obstacles in his path,\n        surpassing his limit many times over, vanquishing all evil that stood in his way.\n        And now, after a long and arduous journey, the knight had finally reached the dragon's castle.\n        The castle loomed before him, a dark and foreboding structure, its walls towering high above him, its gates\n        hiding behind them what may well be the most fearsome creature in all the land.\n        Gathering his courage, the knight entered the castle, his sword drawn, his shield raised, ready to face\n        whatever lay ahead.\n        And there, in the heart of the castle, he found the dragon.\n        The dragon, a massive and terrifying beast, stood before him, its scales gleaming in the dim light, its eyes\n        a molten gold, each larger than he is tall, its claws sharp and daggers, and the very air around it seemed to\n        tremble with its presence.\n        The knight, undaunted, condemned the dragon for its crime, accusing it of kidnapping the princess and bringing\n        sorrow and despair to the kingdom.\n        The dragon, however, responded in a way that the knight did not expect, saying:\n        ",
    "possible_remarks": [
      [
        "Your princess is in another castle.",
        false,
        "This is a reference to the Super Mario game series,where the princess is always in another castle"
      ],
      [
        "Yeah, I'm not the kidnapper, it's some other dragon. You should leave.",
        false,
        "The dragon iseither really innocent or justplaying dumb"
      ],
      [
        "Hey, I'm just trying to make a living here. Do you how lucrative princess kidnapping is?",
        false,
        "The dragon is just trying to make a living,and princess kidnapping may really be a lucrative business. There isn't necessarily any sarcasm here"
      ],
      [
        "Oh, now that you say that, I realize how terrible that was. I am ever so sorry.",
        true,
        "The dragon is being sarcastic here, as it is highly unlikely that the dragon is actually sorry for kidnapping the princess after just being condemned for it by the knight"
      ]
    ],
    "sarcastic_index": -1
  },
  {
    "title": "Lost Keys",
    "base_version": "Frantically searching for his keys, John finally found them in the freezer. He muttered to himself:",
    "detailed_version": "\n        Rushing out the door for an important meeting, John realized he couldn't find his keys. Panic setting in, he searched high and low, only to find them in the last place he expected - the freezer. Muttering under his breath, he said:\n        ",
    "novel_version": "\n        It was a chaotic morning for John, as he was running late for an important meeting. In his haste, he couldn't find his keys anywhere. With each passing second, his panic grew, until finally, in a stroke of luck (or perhaps misfortune), he found them nestled between the ice cream and frozen peas in the freezer. Sighing in exasperation, he muttered to himself:\n        ",
    "possible_remarks": [
      [
        "Right, how did I manage to forget them in the freezer?",
        false,
        "John is expressing his forgetfulness, but there's no hint of sarcasm"
      ],
      [
        "Of course, they're in the freezer, where else would they be?",
        true,
        "Finding keys in the freezer is highly unexpected, so asking where else they would be is a sarcastic remark expressing surprise"
      ],
      [
        "I must be losing my mind.",
        false,
        "John is expressing frustration at his forgetfulness, but there's no hint of sarcasm"
      ],
      [
        "Ah, there they are, hiding in the icebox.",
        false,
        "This remark acknowledges the unexpected location of the keys but doesn't convey sarcasm"
      ]
    ],
    "sarcastic_index": -1
  },
  {
    "title": "Late for Work",
    "base_version": "Rushing to catch the bus for work, John tripped and fell into a puddle. He muttered to himself:",
    "detailed_version": "\n        Running late for work, John dashed out of his house to catch the bus. However, in his hurry, he tripped over a loose paving stone and landed face-first in a puddle. Muttering under his breath, he said:\n        ",
    "novel_version": "\n        It was just another manic Monday for John, as he scrambled to get ready for work. With barely enough time to grab a coffee, he raced out of his door and sprinted towards the bus stop. But fate had other plans for him that day. As he hurried along the pavement, his foot caught on a stray stone, sending him tumbling into a puddle with a loud splash. Frustrated and soggy, he muttered to himself:\n        ",
    "possible_remarks": [
      [
        "Great, just what I needed to start the day, to get all wet and dirty.",
        true,
        "John's situation is clearly neither great nor what he needed to start the day, so this remark is sarcastic"
      ],
      [
        "Good thing I wore my waterproof shoes today.",
        false,
        "John is trying to find a silver lining in his situation, so the remark not necessarily sarcastic"
      ],
      [
        "Well, that was unexpected.",
        false,
        "John is acknowledging the unexpectedness of his fall, but there's no hint of sarcasm"
      ],
      [
        "Well, I didn't manage to take a shower this morning, so I guess this will have to do.",
        false,
        "While this could be seen as sarcastic, John may also just be speaking seriously. This remark is more open to interpretation than the definitive sarcastic one."
      ]
    ],
    "sarcastic_index": -1
  },
  {
    "title": "Locked Out",
    "base_version": "Returning home after a long day, John realized he forgot his keys inside and was locked out. He muttered to himself:",
    "detailed_version": "\n        Arriving home after a grueling day at work, John reached for his keys only to realize they were still inside the house. Panic rising, he frantically checked his pockets and bags, but there was no sign of them. Muttering under his breath, he said:\n        ",
    "novel_version": "\n        It had been an exhausting day for John, and all he wanted was to relax in the comfort of his own home. However, as he reached for his keys to unlock the door, a sinking feeling washed over him. His keys were nowhere to be found, and a wave of dread crashed over him as he realized they were still sitting on the kitchen counter, just out of reach. With his heart pounding and frustration bubbling inside him, he muttered to himself:\n        ",
    "possible_remarks": [
      [
        "Oh, great, now I need a crash course in lock-picking. Maybe I'll become a burglar in my spare time.",
        true,
        "John's situation is clearly not great, and the remark about becoming a burglar is clearly sarcastic"
      ],
      [
        "I guess it's time to practice my lock-picking skills.",
        false,
        "John is trying to find a solution to his problem, so the remark is not necessarily sarcastic as he may actually try to pick the lock"
      ],
      [
        "Guess I'll be sleeping on the porch tonight.",
        false,
        "John is resigned to his situation, but there's no hint of sarcasm"
      ],
      [
        "Where will I sleep tonight... Oh, maybe if I commit some minor crime, I'll get arrested and have a place to sleep tonight.",
        false,
        "John is trying to find a solution to his problem of lacking a place to sleep, so the remark is not necessarily sarcastic"
      ]
    ],
    "sarcastic_index": -1
  },
  {
    "title": "Restaurant Reservation",
    "base_version": "Arriving at the restaurant for his anniversary dinner, John discovered his reservation was never made. He said to the hostess:",
    "detailed_version": "\n        Stepping into the elegant ambiance of the restaurant, John's anticipation for his anniversary dinner quickly turned to dismay as he was informed that his reservation had never been made. Shocked and frustrated, he glanced around the bustling establishment, searching for a solution to his predicament. He said to the hostess:\n        ",
    "novel_version": "\n        Tonight was meant to be a special occasion for John and his partner, a chance to celebrate their love and reminisce about the wonderful years they've spent together. As they arrived at the upscale restaurant, John's heart swelled with excitement, envisioning a romantic evening filled with delectable cuisine and heartfelt conversation. However, his hopes were dashed when the hostess informed him that their reservation was nowhere to be found. Panic surged through him as he realized the gravity of the situation - their anniversary dinner was in jeopardy. Searching for a solution, He said to the hostess:\n        ",
    "possible_remarks": [
      [
        "Is this some kind of joke? I clearly made a reservation, I have a confirmation email and everything.",
        false,
        "John is expressing his frustration and disbelief, while also trying to provide evidence of his reservation. There is no hint of sarcasm"
      ],
      [
        "Any way we can squeeze in somewhere? I'm sure we can fit in a corner or something.",
        false,
        "John is trying to find a solution to his problem, so the remark is not necessarily sarcastic"
      ],
      [
        "It's our anniversary, please tell me you have something available.",
        false,
        "John is trying to appeal to the hostess's sympathy, so the remark is not necessarily sarcastic"
      ],
      [
        "Well, I guess we'll just have to eat at the fast-food joint down the street. I'm sure they have a romantic ambiance too.",
        true,
        "The remark about the fast-food joint having a romantic ambiance is clearly sarcastic, as fast-food joints are not known for their romantic settings"
      ]
    ],
    "sarcastic_index": -1
  },
  {
    "title": "Teleportation Mishap",
    "base_version": "Experimenting with a teleportation device, John accidentally swapped bodies with his cat. He exclaimed:",
    "detailed_version": "\n        Curious about the capabilities of his latest invention, John decided to test out his teleportation device. However, a miscalibration resulted in an unexpected outcome - he found himself inhabiting the body of his bewildered cat. Surprised and perplexed, he exclaimed:\n        ",
    "novel_version": "\n        With a spark of scientific curiosity, John couldn't resist the temptation to experiment with his latest invention - a cutting-edge teleportation device. Eager to push the boundaries of technology, he stepped into the teleporter, expecting to emerge on the other side unscathed. But fate had other plans. A glitch in the system caused a bizarre malfunction, and in an instant, John found himself trapped in the furry confines of his pet cat's body.Surprised and perplexed , he couldn't help but exclaim:\n        ",
    "possible_remarks": [
      [
        "Meow.",
        false,
        "John is a cat now, so it makes sense that he would meow"
      ],
      [
        "I've always been a cat person, but this is taking it to a whole new level.",
        false,
        "John is making a playful observation about his situation, but this is not necessarily sarcastic"
      ],
      [
        "Oh great, I always wanted to use a litter box and have a human slave to take care of me. What a dream come true.",
        true,
        "John's remark about his situation his dream come true is clearly sarcastic, as most people wouldn't want to be stuck in a cat's body, or use a litter box."
      ],
      [
        "Oh. OH NO. OH NO NO NO NO NO.",
        false,
        "Being in shock and disbelief is probably as normal a reaction as any in this situation"
      ]
    ],
    "sarcastic_index": -1
  },
  {
    "title": "Alien Encounter",
    "base_version": "Walking in the park, John stumbled upon a group of aliens having a picnic. He remarked:",
    "detailed_version": "\n        Taking a leisurely stroll in the park, John was astounded to stumble upon a group of extraterrestrial beings enjoying a picnic. Unsure if he was hallucinating or witnessing a genuine encounter, he couldn't help but remark:\n        ",
    "novel_version": "\n        It was a tranquil afternoon in the park, with the gentle rustle of leaves and the distant chirping of birds providing a soothing backdrop. Lost in thought, John wandered aimlessly until he stumbled upon a scene straight out of a sci-fi movie - a group of aliens, complete with otherworldly technology, enjoying a leisurely picnic on the grass. Shocked and bewildered, he stood frozen in disbelief, struggling to comprehend the surreal sight before him. After a moment of stunned silence, he managed to muster a remark:\n        ",
    "possible_remarks": [
      [
        "I forgot my meds today, didn't I?",
        false,
        "The situation is so bizarre that John may well be hallucinating, due to actually forgetting his medication"
      ],
      [
        "I'm about to be silenced by the government, aren't I?",
        false,
        "John is expressing fear of government intervention, which is a common theme in alien encounter stories"
      ],
      [
        "Yeah, sure, this is totally normal. Just an average day in the park. I totally saw this coming when I left the house.",
        true,
        "John's remark about the situation being normal is clearly sarcastic, as encountering aliens is anything but normal"
      ],
      [
        "I WAS RIGHT! I WAS RIGHT ALL ALONG! I KNEW IT! HAHAHAHAHAHAHA!",
        false,
        "John is expressing excitement at being proven right about the existence of aliens, but there's no hint of sarcasm"
      ]
    ],
    "sarcastic_index": -1
  }
]