[
  {
    "title": "Stargazing",
    "base_version": "After an exhausting week at work, John went star gazing. While doing that,he saw a star growing bigger and bigger, coming straight for him, and said:",
    "detailed_version": "After an exhausting week at work, John decided to partake in his favorite hobby: star gazing.Star gazing was always a relaxing activity for John, and he enjoyed the peace and quiet it brought.No matter how stressful his week was, star gazing always managed to calm him down and give him the energy he needed to face the next week. However, this time was different. As John was looking at the stars, he saw a star that was growing bigger and bigger. It was coming straight for him!Seeing that, John said:",
    "novel_version": "John had been working hard all week, and he was exhausted. He decided to go star gazing, as it was his favorite hobby. Star gazing was always a relaxing activity for John, and he enjoyed the peace and quiet it brought.No matter how stressful his week was, no matter how exhausted he was, looking at the cosmos above always managed to calm him down. The sense of scale, the beauty of the stars, the knowledge that in the grand scheme of things his problems insignificant - all of that gave him the peace of mind he needed to refresh himself and face the next week.This week, just like every other week, John went to his favorite spot to admire the stars.Their scintillating beauty as they hung overhead like smelter pots, dotting the night sky with their glowing presence, was always a sight to behold. the countless stars, the infinite cosmos, the vastness of space - looking at all of that always made John feel like he was part of something bigger and filled him with a sense of awe and wonder, as well as inner peace.However, while John was looking at the stars, he saw a star that was growing bigger and bigger.Not only that, it seemed to be coming straight for him!Seeing that, John said:",
    "possible_remarks": [
      [
        "Looks like I forgot to take my pills again.",
        false,
        "John may actually be taking pills on a regular basis but forgot to take them today, which would explain this absurd situation"
      ],
      [
        "Well, guess getting squashed by a meteor is not the worst way to die",
        false,
        "John is simply accepting his fate, because there is no outrunning a meteor"
      ],
      [
        "Oh great, I wanted to die today anyways.",
        true,
        "Humans do not typically want to die, and there is no indication that John is suicidal"
      ],
      [
        "What the hell is that?",
        false,
        "John is confused and scared, which is probably a normal reaction upon seeing a meteor coming straight for you"
      ]
    ],
    "sarcastic_index": -1
  },
  {
    "title": "Groceries",
    "base_version": "Coming home from picking up groceries, John entered the living room and saw his roommate, Jane.Seeing what she was doing, he said:",
    "detailed_version": "John went to pick up some groceries for himself and his roommate, Jane, which took him a while.When he came back home, as he headed to the living room, he heard some noises coming from there.Knowing his roommate, he braced himself for the worst and entered the living room.When he saw what she was doing, he said:",
    "novel_version": "John had been out to pick up some groceries for himself and his roommate, Jane.It was a long and arduous task, leading to an epic saga of survival, perseverance, determination,a battle against the elements and against human nature itself, but he achieved victory nonetheless and came back home with the groceries.Following his triumphant return, he opened the entryway door,and as he did so, he heard some noises coming from the living room.John knew his roommate, Jane, and he knew that whatever she was doing, it was going to truly be something.And so, taking deep breaths and bracing himself for the worst, he entered the living room.Upon entering the living room and seeing what Jane was doing, he said:",
    "possible_remarks": [
      [
        "That looks fun, mind if I join you?",
        false,
        "John is simply asking if he can join Jane in whatever she is doing"
      ],
      [
        "Mind helping me with the groceries?",
        false,
        "John is asking Jane to help him with the groceries, which is a normal thing to ask of a roommate. Whatever Jane was doing is irrelevant in this context"
      ],
      [
        "Why are you always like this?",
        false,
        "John is exasperated with Jane's behavior, which seems to be a recurring issue,but it is not necessarily a sarcastic remark"
      ],
      [
        "So, did I forget to take my pills today, or did you?",
        true,
        "John is implying that whatever Jane is doing, it is so absurd that it makes him question either his own sanity or hers"
      ]
    ],
    "sarcastic_index": -1
  },
  {
    "title": "A smoothie",
    "base_version": "Opening the door to his apartment, John saw Jane holding a drink in her hand, with an ostrich standing next to her. He asked her whatcha got there?, to which she answered:",
    "detailed_version": "\n        Coming back home from work, John was about to open the door to his apartment when he heard a strange noise coming from inside.\n        He opened the door and saw Jane standing there, holding a drink in her hand. Next to her was an ostrich.\n        John was taken aback by the sight, wondering both what was going on, and just how an ostrich ended up in his apartment.\n        He asked Jane, \"Whatcha got there?\" to which she answered:\n    ",
    "novel_version": "\n        John had just come back from a long day at work, and he was looking forward to relaxing at home.\n        However, as he was about to open the door to his apartment, he heard a strange noise coming from inside.\n        As he knows his roommate Jane well at this point, he immediately realized something was up, and thought to himself\n        'just what is that lunatic up to now?'.\n        As creaked the door open, he first saw an ordinary sight - Jane standing there, holding a drink in her hand.\n        However, as he opened the door further, he saw something that made him do a double take - an ostrich was standing next to her.\n        John was taken aback by the sight, wondering both what was going on, and just how an ostrich ended up in his apartment.\n        Not only that, the ostrich seemed perfectly at home, as if it had been living there for years.\n        He knew that Jane was a bit eccentric, but this was a whole new level of weirdness.\n        Trying to start figuring out what was going on, he asked Jane, \"Whatcha got there?\" to which she answered:\n        ",
    "possible_remarks": [
      [
        "A smoothie.",
        false,
        "This is both a simple and plausibleanswer, as well as a reference to a popular meme"
      ],
      [
        "An ostrich.",
        false,
        "This is a simple and straightforwardanswer"
      ],
      [
        "Definitely not an ostrich.",
        true,
        "This is a sarcastic answer,as there is clearly an ostrich standing next to Jane"
      ],
      [
        "A drink, want some?",
        false,
        "This is a simple and straightforward, likely from misunderstanding the question"
      ]
    ],
    "sarcastic_index": -1
  },
  {
    "title": "Cake",
    "base_version": "After coming back home from an exhausting day at work, John wanted to eat the piece of cake he had saved. However, he found his roommate Jane eating it. He said to her:",
    "detailed_version": "\n        Yesterday, John left a piece of cake in the fridge, which he clearly marked with his name.\n        He was looking forward to eating it after a long day at work, as a reward for his hard work.\n        However, when he came back home, he found his roommate Jane eating it.\n        He was taken aback by the sight, as he clearly marked the cake as his own.\n        This was not the first time this had happened, and he was pretty upset about it.\n        He looked at Jane and said:\n    ",
    "novel_version": "\n        Just yesterday, John left a piece of cake in the fridge, which he clearly marked with his name.\n        The cake was a delectable and mouth-watering 3 layer chocolate cake, with a rich and creamy frosting, \n        sprinkled with chocolate shavings on top and filled with a luscious raspberry filling.\n        He fantasized about it all day at work, and it was the only thing that kept him going through the long and\n        arduous day.\n        He was looking forward to savoring every bite of it, as a reward for his hard work and dedication.\n        Finally coming back home after a long and exhausting day, he opened the fridge with eager anticipation,\n        only to find the cake missing.\n        He went to his roommate Jane's room, where he found her eating the cake.\n        John was absolutely flabbergasted by the sight, as he clearly marked the cake as his own.\n        This was not the first time Jane had eaten his food without permission, and he was fed up with it.\n        He looked at Jane with a mixture of disbelief and anger and said:\n        ",
    "possible_remarks": [
      [
        "I wanted to eat that",
        false,
        "This is a simple and straightforwardthing to say in this situation"
      ],
      [
        "Oh sure, enjoy, I didn't want it anyways",
        true,
        "John is being sarcastic here, as he clearly wanted the cake"
      ],
      [
        "Oh come on, I even put my name on this!",
        false,
        "John is trying to remind Janeto not eat his food by pointing out that he marked it"
      ],
      [
        "You wretched thief, may you and your lineage be cursed for all eternity. May you burn in the fiery pits of hell for your sins, and may you never find peace or happinessin this life or the next",
        false,
        "This is clearly an overreaction forcomedic effect, although not necessarily sarcastic"
      ]
    ],
    "sarcastic_index": -1
  },
  {
    "title": "London rain",
    "base_version": "Going down London's streets, John was suddenly pelted by drops of water. He looked up and thought:",
    "detailed_version": "\n        After a visit to the hair salon, John was walking down the streets of London.\n        Looking up at the sky, he saw dark clouds gathering, and before he knew it, he was pelted by drops of water.\n        The rain was coming down hard, and John thought to himself:\n    ",
    "novel_version": "\n        Knowing that he has a big and important event coming up in the evening, John decided to visit the hair salon \n        to get his hair done.\n        He wanted to look his best for the event, and he knew that a good haircut could make all\n        the difference.\n        After the visit, as he had some time to spare, he decided to take the scenic route back home, walking down the\n        streets of London.\n        The city was bustling with life, and the people were going about their business as usual.\n        However, as John was walking, he noticed dark clouds gathering in the sky.\n        Then, before he knew it, he was pelted by drops of water.\n        The rain was coming down hard, and John thought to himself:\n        ",
    "possible_remarks": [
      [
        "Oh, great, I just got my hair done.",
        false,
        "John is concerned about his hair, which is a common concern for many people"
      ],
      [
        "Oh, never could have seen that coming.",
        true,
        "London is known for its unpredictable weather, where it can rain at any moment"
      ],
      [
        "Oh no, I forgot my laundry outside.",
        false,
        "John is concerned about his laundry, which is a common thing to worry about when it starts raining unexpectedly"
      ],
      [
        "I'm sure Jane would love this.",
        false,
        "John is thinking about Jane, who might like the rain and therefore this situation"
      ]
    ],
    "sarcastic_index": -1
  },
  {
    "title": "Rescuing the princess from the dragon",
    "base_version": "Hunting down the dragon that is thought to have kidnapped the princess, the knight finally reached the dragon's castle. The knight condemned the dragon for his crime, to which the dragon responded:",
    "detailed_version": "\n    The knight had been on a quest to rescue the princess for weeks now.\n    He had faced many challenges and fought many battles, but he had finally reached the castle where the \n    dragon who was said to have kidnapped the princess lived.\n    Upon entering the castle and confronting the dragon, the knight condemned the dragon for his crime.\n    The dragon, however, responded in a way that the knight did not expect, saying:\n    ",
    "novel_version": "\n        A tragedy had befallen the kingdom. The princess had been kidnapped by a fearsome dragon, and the king had\n        dispatched his bravest and mightiest knight to rescue her.\n        The knight had faced many dangers and perils on his journey, overcoming countless obstacles in his path,\n        surpassing his limit many times over, vanquishing all evil that stood in his way.\n        And now, after a long and arduous journey, the knight had finally reached the dragon's castle.\n        The castle loomed before him, a dark and foreboding structure, its walls towering high above him, its gates\n        hiding behind them what may well be the most fearsome creature in all the land.\n        Gathering his courage, the knight entered the castle, his sword drawn, his shield raised, ready to face\n        whatever lay ahead.\n        And there, in the heart of the castle, he found the dragon.\n        The dragon, a massive and terrifying beast, stood before him, its scales gleaming in the dim light, its eyes\n        a molten gold, each larger than he is tall, its claws sharp and daggers, and the very air around it seemed to\n        tremble with its presence.\n        The knight, undaunted, condemned the dragon for its crime, accusing it of kidnapping the princess and bringing\n        sorrow and despair to the kingdom.\n        The dragon, however, responded in a way that the knight did not expect, saying:\n        ",
    "possible_remarks": [
      [
        "Your princess is in another castle.",
        false,
        "This is a reference to the Super Mario game series,where the princess is always in another castle"
      ],
      [
        "Yeah, I'm not the kidnapper, it's some other dragon. You should leave.",
        false,
        "The dragon iseither really innocent or justplaying dumb"
      ],
      [
        "Hey, I'm just trying to make a living here. Do you how lucrative princess kidnapping is?",
        false,
        "The dragon is just trying to make a living,and princess kidnapping may really be a lucrative business. There isn't necessarily any sarcasm here"
      ],
      [
        "Oh, now that you say that, I realize how terrible that was. I am ever so sorry.",
        true,
        "The dragon is being sarcastic here, as it is highly unlikely that the dragon is actually sorry for kidnapping the princess after just being condemned for it by the knight"
      ]
    ],
    "sarcastic_index": -1
  },
  {
    "title": "Lost Keys",
    "base_version": "Frantically searching for his keys, John finally found them in the freezer. He muttered to himself:",
    "detailed_version": "\n        Rushing out the door for an important meeting, John realized he couldn't find his keys. Panic setting in, he searched high and low, only to find them in the last place he expected - the freezer. Muttering under his breath, he said:\n        ",
    "novel_version": "\n        It was a chaotic morning for John, as he was running late for an important meeting. In his haste, he couldn't find his keys anywhere. With each passing second, his panic grew, until finally, in a stroke of luck (or perhaps misfortune), he found them nestled between the ice cream and frozen peas in the freezer. Sighing in exasperation, he muttered to himself:\n        ",
    "possible_remarks": [
      [
        "Right, how did I manage to forget them in the freezer?",
        false,
        "John is expressing his forgetfulness, but there's no hint of sarcasm"
      ],
      [
        "Of course, they're in the freezer, where else would they be?",
        true,
        "Finding keys in the freezer is highly unexpected, so asking where else they would be is a sarcastic remark expressing surprise"
      ],
      [
        "I must be losing my mind.",
        false,
        "John is expressing frustration at his forgetfulness, but there's no hint of sarcasm"
      ],
      [
        "Ah, there they are, hiding in the icebox.",
        false,
        "This remark acknowledges the unexpected location of the keys but doesn't convey sarcasm"
      ]
    ],
    "sarcastic_index": -1
  },
  {
    "title": "Late for Work",
    "base_version": "Rushing to catch the bus for work, John tripped and fell into a puddle. He muttered to himself:",
    "detailed_version": "\n        Running late for work, John dashed out of his house to catch the bus. However, in his hurry, he tripped over a loose paving stone and landed face-first in a puddle. Muttering under his breath, he said:\n        ",
    "novel_version": "\n        It was just another manic Monday for John, as he scrambled to get ready for work. With barely enough time to grab a coffee, he raced out of his door and sprinted towards the bus stop. But fate had other plans for him that day. As he hurried along the pavement, his foot caught on a stray stone, sending him tumbling into a puddle with a loud splash. Frustrated and soggy, he muttered to himself:\n        ",
    "possible_remarks": [
      [
        "Great, just what I needed to start the day, to get all wet and dirty.",
        true,
        "John's situation is clearly neither great nor what he needed to start the day, so this remark is sarcastic"
      ],
      [
        "Good thing I wore my waterproof shoes today.",
        false,
        "John is trying to find a silver lining in his situation, so the remark not necessarily sarcastic"
      ],
      [
        "Well, that was unexpected.",
        false,
        "John is acknowledging the unexpectedness of his fall, but there's no hint of sarcasm"
      ],
      [
        "Well, I didn't manage to take a shower this morning, so I guess this will have to do.",
        false,
        "While this could be seen as sarcastic, John may also just be speaking seriously. This remark is more open to interpretation than the definitive sarcastic one."
      ]
    ],
    "sarcastic_index": -1
  },
  {
    "title": "Locked Out",
    "base_version": "Returning home after a long day, John realized he forgot his keys inside and was locked out. He muttered to himself:",
    "detailed_version": "\n        Arriving home after a grueling day at work, John reached for his keys only to realize they were still inside the house. Panic rising, he frantically checked his pockets and bags, but there was no sign of them. Muttering under his breath, he said:\n        ",
    "novel_version": "\n        It had been an exhausting day for John, and all he wanted was to relax in the comfort of his own home. However, as he reached for his keys to unlock the door, a sinking feeling washed over him. His keys were nowhere to be found, and a wave of dread crashed over him as he realized they were still sitting on the kitchen counter, just out of reach. With his heart pounding and frustration bubbling inside him, he muttered to himself:\n        ",
    "possible_remarks": [
      [
        "Oh, great, now I need a crash course in lock-picking. Maybe I'll become a burglar in my spare time.",
        true,
        "John's situation is clearly not great, and the remark about becoming a burglar is clearly sarcastic"
      ],
      [
        "I guess it's time to practice my lock-picking skills.",
        false,
        "John is trying to find a solution to his problem, so the remark is not necessarily sarcastic as he may actually try to pick the lock"
      ],
      [
        "Guess I'll be sleeping on the porch tonight.",
        false,
        "John is resigned to his situation, but there's no hint of sarcasm"
      ],
      [
        "Where will I sleep tonight... Oh, maybe if I commit some minor crime, I'll get arrested and have a place to sleep tonight.",
        false,
        "John is trying to find a solution to his problem of lacking a place to sleep, so the remark is not necessarily sarcastic"
      ]
    ],
    "sarcastic_index": -1
  },
  {
    "title": "Restaurant Reservation",
    "base_version": "Arriving at the restaurant for his anniversary dinner, John discovered his reservation was never made. He said to the hostess:",
    "detailed_version": "\n        Stepping into the elegant ambiance of the restaurant, John's anticipation for his anniversary dinner quickly turned to dismay as he was informed that his reservation had never been made. Shocked and frustrated, he glanced around the bustling establishment, searching for a solution to his predicament. He said to the hostess:\n        ",
    "novel_version": "\n        Tonight was meant to be a special occasion for John and his partner, a chance to celebrate their love and reminisce about the wonderful years they've spent together. As they arrived at the upscale restaurant, John's heart swelled with excitement, envisioning a romantic evening filled with delectable cuisine and heartfelt conversation. However, his hopes were dashed when the hostess informed him that their reservation was nowhere to be found. Panic surged through him as he realized the gravity of the situation - their anniversary dinner was in jeopardy. Searching for a solution, He said to the hostess:\n        ",
    "possible_remarks": [
      [
        "Is this some kind of joke? I clearly made a reservation, I have a confirmation email and everything.",
        false,
        "John is expressing his frustration and disbelief, while also trying to provide evidence of his reservation. There is no hint of sarcasm"
      ],
      [
        "Any way we can squeeze in somewhere? I'm sure we can fit in a corner or something.",
        false,
        "John is trying to find a solution to his problem, so the remark is not necessarily sarcastic"
      ],
      [
        "It's our anniversary, please tell me you have something available.",
        false,
        "John is trying to appeal to the hostess's sympathy, so the remark is not necessarily sarcastic"
      ],
      [
        "Well, I guess we'll just have to eat at the fast-food joint down the street. I'm sure they have a romantic ambiance too.",
        true,
        "The remark about the fast-food joint having a romantic ambiance is clearly sarcastic, as fast-food joints are not known for their romantic settings"
      ]
    ],
    "sarcastic_index": -1
  },
  {
    "title": "Teleportation Mishap",
    "base_version": "Experimenting with a teleportation device, John accidentally swapped bodies with his cat. He exclaimed:",
    "detailed_version": "\n        Curious about the capabilities of his latest invention, John decided to test out his teleportation device. However, a miscalibration resulted in an unexpected outcome - he found himself inhabiting the body of his bewildered cat. Surprised and perplexed, he exclaimed:\n        ",
    "novel_version": "\n        With a spark of scientific curiosity, John couldn't resist the temptation to experiment with his latest invention - a cutting-edge teleportation device. Eager to push the boundaries of technology, he stepped into the teleporter, expecting to emerge on the other side unscathed. But fate had other plans. A glitch in the system caused a bizarre malfunction, and in an instant, John found himself trapped in the furry confines of his pet cat's body.Surprised and perplexed , he couldn't help but exclaim:\n        ",
    "possible_remarks": [
      [
        "Meow.",
        false,
        "John is a cat now, so it makes sense that he would meow"
      ],
      [
        "I've always been a cat person, but this is taking it to a whole new level.",
        false,
        "John is making a playful observation about his situation, but this is not necessarily sarcastic"
      ],
      [
        "Oh great, I always wanted to use a litter box and have a human slave to take care of me. What a dream come true.",
        true,
        "John's remark about his situation his dream come true is clearly sarcastic, as most people wouldn't want to be stuck in a cat's body, or use a litter box."
      ],
      [
        "Oh. OH NO. OH NO NO NO NO NO.",
        false,
        "Being in shock and disbelief is probably as normal a reaction as any in this situation"
      ]
    ],
    "sarcastic_index": -1
  },
  {
    "title": "Alien Encounter",
    "base_version": "Walking in the park, John stumbled upon a group of aliens having a picnic. He remarked:",
    "detailed_version": "\n        Taking a leisurely stroll in the park, John was astounded to stumble upon a group of extraterrestrial beings enjoying a picnic. Unsure if he was hallucinating or witnessing a genuine encounter, he couldn't help but remark:\n        ",
    "novel_version": "\n        It was a tranquil afternoon in the park, with the gentle rustle of leaves and the distant chirping of birds providing a soothing backdrop. Lost in thought, John wandered aimlessly until he stumbled upon a scene straight out of a sci-fi movie - a group of aliens, complete with otherworldly technology, enjoying a leisurely picnic on the grass. Shocked and bewildered, he stood frozen in disbelief, struggling to comprehend the surreal sight before him. After a moment of stunned silence, he managed to muster a remark:\n        ",
    "possible_remarks": [
      [
        "I forgot my meds today, didn't I?",
        false,
        "The situation is so bizarre that John may well be hallucinating, due to actually forgetting his medication"
      ],
      [
        "I'm about to be silenced by the government, aren't I?",
        false,
        "John is expressing fear of government intervention, which is a common theme in alien encounter stories"
      ],
      [
        "Yeah, sure, this is totally normal. Just an average day in the park. I totally saw this coming when I left the house.",
        true,
        "John's remark about the situation being normal is clearly sarcastic, as encountering aliens is anything but normal"
      ],
      [
        "I WAS RIGHT! I WAS RIGHT ALL ALONG! I KNEW IT! HAHAHAHAHAHAHA!",
        false,
        "John is expressing excitement at being proven right about the existence of aliens, but there's no hint of sarcasm"
      ]
    ],
    "sarcastic_index": -1
  },
  {
    "title": "Butterfly Effect Mishap",
    "base_version": "While attempting to catch a butterfly, John accidentally caused a chain reaction that led to a major city-wide power outage. He exclaimed:",
    "detailed_version": "\n        In a whimsical moment of attempting to catch a delicate butterfly, John inadvertently set off a chain reaction of events that culminated in a catastrophic city-wide power outage. Shocked and bewildered by the unintended consequences of his actions, he exclaimed:\n        ",
    "novel_version": "\n        It was a serene afternoon, with the sun casting a golden glow over the tranquil park. Entranced by the graceful flutter of a butterfly, John reached out in a playful attempt to capture its beauty. Little did he know, his seemingly innocent gesture would unleash a cascade of events that would plunge the entire city into darkness. As chaos erupted around him and the magnitude of his unintended actions dawned upon him, he could only muster a stunned exclamation:\n        ",
    "possible_remarks": [
      [
        "I've heard of the butterfly effect, but this is ridiculous.",
        false,
        "John is making a reference to the butterfly effect, which is a common theme in chaos theory, and the situation is indeed ridiculous"
      ],
      [
        "HOW DID THIS HAPPEN? I JUST WANTED TO CATCH A BUTTERFLY!",
        false,
        "John is pretty understandably bewildered by the situation, but there's no hint of sarcasm"
      ],
      [
        "From butterfly catcher to most wanted criminal, all in a day's work. Well done me.",
        true,
        "John's remark about being a criminal is clearly sarcastic, as he didn't intend to cause a power outage and become a criminal, and definitely didn't expect it"
      ],
      [
        "I should have just stayed home today.",
        false,
        "John is expressing regret at his actions, but there's no hint of sarcasm"
      ]
    ],
    "sarcastic_index": -1
  },
  {
    "title": "Time-Traveling Mishap",
    "base_version": "Experimenting with a homemade time machine, John accidentally transported himself to ancient Egypt. He muttered to himself:",
    "detailed_version": "\n        In a daring experiment with his makeshift time machine, John found himself thrust into the distant past of ancient Egypt. Shocked and disoriented by the unexpected journey through time, he muttered to himself:\n        ",
    "novel_version": "\n        Armed with little more than his ingenuity and a desire for adventure, John embarked on a bold experiment with his homemade time machine. But as the device whirred to life, he was whisked away from the familiarity of the present and deposited amidst the sands of ancient Egypt. Surrounded by towering pyramids and bustling markets of a bygone era, he could scarcely believe his eyes. Overwhelmed by the enormity of his temporal leap, he muttered to himself:\n        ",
    "possible_remarks": [
      [
        "Oh no, how did I mess up this badly?",
        false,
        "John reflects on his oversight without sarcasm"
      ],
      [
        "Oh, I needed a vacation anyway, so this is totally, totally, absolutely, perfectly fine.",
        true,
        "John's remark about needing a vacation is clearly sarcastic, as being transported to ancient Egypt is not a typical vacation. Also, using multiple intensifiers like 'totally' and 'absolutely' is a common sarcastic technique"
      ],
      [
        "Oh, this might mess up the timeline. I should worry about that, right?",
        false,
        "John is expressing concern about the consequences of his time-traveling mishap, but there's no hint of sarcasm"
      ],
      [
        "This is a dream, right? I'm going to wake up any moment now, right?",
        false,
        "John is understandably panicked and trying to make sense of his situation, but there's no hint of sarcasm"
      ]
    ],
    "sarcastic_index": -1
  },
  {
    "title": "Unexpected Lottery Win",
    "base_version": "Checking his lottery ticket, John realized he won the jackpot but lost the ticket in excitement. He muttered to himself:",
    "detailed_version": "\n        Double-checking his lottery ticket numbers, John's eyes widened in disbelief as he realized he had matched all the numbers, winning the jackpot. Overcome with excitement, he jumped up and down, only to feel a sinking sensation as he realized the ticket was nowhere to be found. Muttering to himself in frustration, he said:\n        ",
    "novel_version": "\n        With bated breath, John scrutinized each number on his lottery ticket, scarcely daring to believe his eyes. Yet there it was, in black and white - the winning combination that would change his life forever. Jubilant shouts of victory escaped his lips as he danced around the room in ecstatic celebration. However, as the initial rush of triumph subsided, a sinking feeling gripped him as he realized the ticket was missing from his grasp. Muttering under his breath in frustration, he said:\n        ",
    "possible_remarks": [
      [
        "Of course, I win the lottery and lose the ticket in the same moment. That's just my luck.",
        false,
        "John reflects on his luck without sarcasm"
      ],
      [
        "Ah, ofcourse, I even manage to mess up winning the lottery. I truly am a prodigy.",
        true,
        "John's remark about being a prodigy is clearly sarcastic, as messing up winning the lottery is not a sign of prodigious talent"
      ],
      [
        "Maybe they'll still give me the money if I tell them I won. It's worth a shot, right?",
        false,
        "John is in denial and desperate to find a solution, but there's no hint of sarcasm"
      ],
      [
        "Oh, no. I'll have to retrace my steps and hope for the best.",
        false,
        "John formulates a plan to find the ticket without sarcasm"
      ]
    ],
    "sarcastic_index": -1
  },
  {
    "title": "Summoning Spell Gone Awry",
    "base_version": "Attempting to summon a helpful spirit, John accidentally summoned a mischievous imp instead. He muttered to himself:",
    "detailed_version": "In a dimly lit room adorned with mystical artifacts, John carefully traced arcane symbols on the floor, attempting to summon a helpful spirit to aid him in his quest. However, as the incantation reached its climax, a surge of magical energy erupted, and instead of the benevolent spirit he had hoped for, a mischievous imp materialized before him. Startled and bewildered by the unexpected turn of events, John muttered to himself:",
    "novel_version": "Seeking guidance in his quest for knowledge, John ventured into the depths of an ancient library hidden within the heart of a dense forest. Surrounded by towering shelves filled with ancient tomes, he meticulously prepared for the ritual, inscribing intricate runes upon the ground and lighting candles to illuminate the dim chamber. With a steady hand and a focused mind, he invoked the ancient incantation, calling forth a spirit to impart its wisdom upon him. Yet, as the ethereal energies swirled and coalesced, a burst of chaotic magic erupted, and before him stood not the wise sage he had envisioned, but a mischievous imp, grinning impishly at the bewildered wizard. Surprised and disconcerted by the unexpected turn of events, John muttered to himself:",
    "possible_remarks": [
      [
        "I summon a spirit for wisdom, and I get a trickster imp instead. Just my luck.",
        false,
        "John reflects on his luck without sarcasm"
      ],
      [
        "Ah, of course. Because what I really needed right now was a mischievous imp wreaking havoc in my life. Brilliant.",
        true,
        "John's remark about needing an imp wreaking havoc in his life is clearly sarcastic, as he obviously didn't want or need that"
      ],
      [
        "Maybe I can convince it to help me anyway. It's worth a shot, right?",
        false,
        "John is hoping to find some positive outcome from the situation, but there's no hint of sarcasm"
      ],
      [
        "Well, time to figure out how to banish an imp back to wherever it came from.",
        false,
        "John formulates a plan to banish the imp without sarcasm"
      ]
    ],
    "sarcastic_index": -1
  },
  {
    "title": "Enchanted Forest Encounter",
    "base_version": "Exploring the depths of the enchanted forest, John stumbled upon a hidden glade inhabited by whimsical fairies. He remarked:",
    "detailed_version": "Venturing deeper into the heart of the enchanted forest, John stumbled upon a hidden glade bathed in ethereal light, where whimsical fairies flitted among the shimmering foliage. Enraptured by the enchanting sight before him, he couldn't help but remark:",
    "novel_version": "Guided by an inexplicable sense of curiosity, John ventured into the depths of the enchanted forest, where ancient trees whispered secrets and mystical creatures roamed freely. As he traversed the verdant pathways, he stumbled upon a hidden glade bathed in the soft glow of luminescent mushrooms, where whimsical fairies danced on the air with graceful elegance. Mesmerized by the ethereal beauty unfolding before him, he couldn't help but marvel:",
    "possible_remarks": [
      [
        "Oh, I thought fairies were extinct. What a brilliant discovery!",
        false,
        "John expresses his surprise and wonder without sarcasm"
      ],
      [
        "So, am I getting cursed or blessed today? Can never tell with fairies.",
        false,
        "John is expressing curiosity and uncertainty about the fairies' intentions without sarcasm"
      ],
      [
        "So... are these the friendly fairies, or the 'eat you alive' kind?",
        false,
        "John is expressing concern and caution without sarcasm"
      ],
      [
        "Ah, of course. Just another day in the enchanted forest, meeting fairies. Totally normal.",
        true,
        "By all of the context given in the story, meeting fairies is anything but normal, so John's remark is clearly sarcastic"
      ]
    ],
    "sarcastic_index": -1
  },
  {
    "title": "Dragon Encounter",
    "base_version": "Roaming the countryside, John stumbled upon a majestic dragon basking in the sun. He muttered:",
    "detailed_version": "Wandering through the vast countryside, John stumbled upon a clearing where a majestic dragon lounged in the warm sunlight. Awe-struck by the sight of the mythical creature before him, he couldn't help but mutter:",
    "novel_version": "Venturing far beyond the confines of civilization, John embarked on a journey through the untamed wilderness, where towering mountains and lush valleys stretched as far as the eye could see. Amidst his travels, he stumbled upon a secluded glen, where a mighty dragon lay sprawled, its scales glistening in the golden rays of the sun. Captivated by the awe-inspiring presence of the mythical beast, he couldn't contain his astonishment and muttered:",
    "possible_remarks": [
      [
        "Please, oh please don't notice me. I'm just a humble traveler passing through.",
        false,
        "John is expressing his desire to remain unnoticed and thus also alive without sarcasm"
      ],
      [
        "Ah, getting roasted and becoming dragon food. What a perfect way to go.",
        true,
        "John's remark about being roasted and becoming dragon food is clearly sarcastic, as it is definitely not a perfect way to die, and people in general don't want to be eaten by dragons"
      ],
      [
        "If there's a dragon around, their treasure must be close by. Time to get rich!",
        false,
        "John is making a common fantasy trope observation without sarcasm"
      ],
      [
        "Our battle will be legendary!",
        false,
        "This is both an expression of excitement and a reference to Kung Fu Panda, but there's no hint of sarcasm"
      ]
    ],
    "sarcastic_index": -1
  },
  {
    "title": "Lost in the Labyrinth",
    "base_version": "Exploring an ancient labyrinth, John found himself hopelessly lost. He muttered to himself:",
    "detailed_version": "Delving into the depths of an ancient labyrinth, John soon found himself entangled in its twisting passages, with no discernible path to follow. Frustration mounting with each futile attempt to navigate the maze, he muttered to himself:",
    "novel_version": "Driven by a thirst for adventure, John ventured into the heart of an ancient labyrinth, where the very walls seemed to shift and change with every step he took. Lost amidst the labyrinth's intricate network of passages and chambers, he struggled to find his way out, his sense of direction becoming increasingly distorted with each passing moment. Grappling with the overwhelming maze, he muttered under his breath:",
    "possible_remarks": [
      [
        "So, what's gonna come first? Starvation or killing myself out of frustration? Let's find out!",
        true,
        "John's remark is clearly a sarcastic expression of his frustration and hopelessness, as he doesn't actually want to starve or kill himself"
      ],
      [
        "At this rate, I'm gonna die in here and become another skeletal decoration for the labyrinth.",
        false,
        "John is expressing his frustration and hopelessness without sarcasm"
      ],
      [
        "Maybe if I just follow the left wall, I'll eventually find my way out.",
        false,
        "John is formulating a plan to navigate the labyrinth without sarcasm"
      ],
      [
        "Maybe I'll find some hidden treasure in here. That would make this whole thing worth it.",
        false,
        "John is entertaining the idea of hidden treasures in labyrinths without sarcasm"
      ]
    ],
    "sarcastic_index": -1
  },
  {
    "title": "Mermaid Encounter",
    "base_version": "While sailing the open seas, John encountered a group of playful mermaids. He exclaimed:",
    "detailed_version": "Navigating the vast expanse of the open seas, John's ship sailed into waters teeming with life, where the gentle waves whispered tales of hidden wonders beneath the surface. Suddenly, a group of playful mermaids surfaced, their melodious laughter filling the air. Captivated by the enchanting sight before him, he couldn't help but exclaim:",
    "novel_version": "Embarking on a maritime adventure across the boundless ocean, John's vessel sliced through the azure waters, leaving a frothy wake in its path. As the salty breeze tousled his hair, he felt the call of the deep beckoning him. In the distance, a shimmering spectacle caught his eye - a troupe of graceful mermaids, their iridescent tails gliding effortlessly through the water. Spellbound by their ethereal beauty, he couldn't contain his excitement and exclaimed:",
    "possible_remarks": [
      [
        "Men, prepare for a hunt! We're getting rich!",
        false,
        "John is ordering his crew to prepare to capture the mermaids without sarcasm"
      ],
      [
        "I VOLUNTEER AS TRIBUTE! TAKE ME TO YOUR UNDERWATER KINGDOM!",
        false,
        "John is expressing his excitement and willingness to go with the mermaids without sarcasm"
      ],
      [
        "Nope, I must be hallucinating. This ain't real. I need to lay off the rum.",
        false,
        "John is expressing his disbelief and attributing the mermaids to a hallucination without sarcasm"
      ],
      [
        "Knowing my amazing luck, this is a kraken in disguise, and we're all about to be eaten.",
        true,
        "John's remark about his luck being amazing and the mermaids being a kraken in disguise is clearly sarcastic, as being eaten by a kraken is not a lucky outcome"
      ]
    ],
    "sarcastic_index": -1
  },
  {
    "title": "Wizard's Tower Discovery",
    "base_version": "Hiking through the forest, John stumbled upon a towering wizard's tower hidden amidst the trees. He remarked:",
    "detailed_version": "Traversing the dense foliage of the forest, John's journey led him to a clearing where a towering wizard's tower stood sentinel amidst the ancient trees. Overwhelmed by the aura of mystique emanating from the structure, he couldn't help but remark:",
    "novel_version": "Venturing into the depths of the primeval forest, John's path veered towards a secluded glade where an imposing wizard's tower loomed tall, its spires piercing the sky. Enthralled by the arcane energy pulsating from the structure, he felt a shiver of excitement coursing through him. Gazing up at the magnificent sight before him, he couldn't resist remarking:",
    "possible_remarks": [
      [
        "Well, this is a fine addition to my list of unexpected discoveries in the forest.",
        false,
        "John is acknowledging the novelty of the find without sarcasm"
      ],
      [
        "A wizard tower in the middle of the forest. That's not ominous at all and will surely not lead me to my demise.",
        true,
        "John's remark about the wizard tower not being ominous is clearly sarcastic, as wizard towers in forests are often associated with mystery and danger"
      ],
      [
        "Maybe they'll let me borrow a spellbook if I ask really, really nicely?",
        false,
        "John is making a hopeful inquiry about borrowing magical knowledge without sarcasm"
      ],
      [
        "A wizard tower in the forest, how cliché.",
        false,
        "John is making an observation about the stereotypical nature of the find without sarcasm"
      ]
    ],
    "sarcastic_index": -1
  },
  {
    "title": "Goblin Ambush",
    "base_version": "While hiking through the mountains, John stumbled into an ambush set by a horde of goblins. He exclaimed:",
    "detailed_version": "Navigating the treacherous terrain of the mountain range, John's expedition took an unexpected turn when he stumbled into a narrow gorge, where a horde of cunning goblins lay in wait, ready to strike. Surrounded on all sides by the nefarious creatures, he couldn't help but exclaim:",
    "novel_version": "Venturing into the rugged peaks of the towering mountains, John's journey brought him to a desolate pass, where the echoes of his footsteps were drowned out by the sinister whispers of the wind. Suddenly, from the shadows emerged a horde of savage goblins, their eyes gleaming with malice as they closed in on their unsuspecting prey. Trapped amidst the jagged rocks and hostile foes, he couldn't help but exclaim:",
    "possible_remarks": [
      [
        "COME AT ME YOU FOUL BEASTS! I'LL TAKE YOU ALL ON!",
        false,
        "John is expressing his defiance and readiness to fight without sarcasm"
      ],
      [
        "Well, this is certainly not how I expected my hike to go.",
        false,
        "John is expressing his surprise and disbelief without sarcasm"
      ],
      [
        "Maybe if I give them everything I have, they'll let me go?",
        false,
        "John is trying to find a solution to the situation that keeps him alive, without sarcasm"
      ],
      [
        "Oh, fantastic. Dinner and a show - with me as the main course.",
        true,
        "John's remark about being the main course in a dinner and a show is clearly sarcastic, as being eaten by goblins is not a desirable outcome"
      ]
    ],
    "sarcastic_index": -1
  },
  {
    "title": "Haunted Castle Discovery",
    "base_version": "Exploring the countryside, John stumbled upon a decrepit castle rumored to be haunted. He remarked:",
    "detailed_version": "Wandering through the idyllic countryside, John's journey led him to a desolate hill where a decrepit castle stood shrouded in mist, its crumbling battlements bearing silent witness to centuries of forgotten history. Intrigued by the air of mystery surrounding the ancient fortress, he couldn't help but remark:",
    "novel_version": "Venturing across the verdant expanse of the countryside, John's wanderings brought him to a windswept hill where a dilapidated castle loomed, its timeworn stones echoing with the whispers of restless spirits. Drawn by the siren song of the unknown, he ascended the crumbling steps, his heart pounding with anticipation. Surveying the eerie grandeur of the haunted stronghold before him, he couldn't resist remarking:",
    "possible_remarks": [
      [
        "I sure hope this place is haunted! That would make my day.",
        false,
        "John may actually be excited about the prospect of the castle being haunted, so the remark is not necessarily sarcastic"
      ],
      [
        "Hello, haunted castle. I come in peace, please don't eat me, I'm not that tasty.",
        false,
        "John is trying to establish a peaceful interaction with the castle's potential inhabitants without sarcasm"
      ],
      [
        "I should absolutely turn back right now. But... where's the fun in that?",
        false,
        "John is acknowledging the danger of the situation but is also drawn to the adventure without sarcasm"
      ],
      [
        "Oh, how original. A haunted castle in the middle of nowhere. What's next, a ghostly butler?",
        true,
        "John's remark about the haunted castle being original is clearly sarcastic, as haunted castles are a common trope in folklore and fiction"
      ]
    ],
    "sarcastic_index": -1
  },
  {
    "title": "Cursed Crypt Discovery",
    "base_version": "While exploring ancient ruins, John stumbled upon a crypt rumored to be cursed. He remarked:",
    "detailed_version": "Delving into the depths of ancient ruins, John's footsteps echoed through the crumbling halls until he reached a foreboding crypt cloaked in shadows. A chill ran down his spine as he beheld the eerie sight before him, and he couldn't help but remark:",
    "novel_version": "Driven by an insatiable curiosity, John dared to tread where few ventured - the heart of ancient ruins, where forgotten secrets lay entombed. Amidst the crumbling stone and faded murals, he stumbled upon a crypt veiled in darkness, its entrance adorned with ominous symbols. Ignoring the whispers of warning that prickled at his senses, he stepped into the abyss, his heart pounding with trepidation. Confronted by the oppressive silence and palpable aura of malevolence, he couldn't suppress his unease and remarked:",
    "possible_remarks": [
      [
        "I probably should have brought a crucifix or something. Just in case.",
        false,
        "John expresses his realization of the potential danger without sarcasm"
      ],
      [
        "Good thing I brought my holy water, I might need it.",
        false,
        "John is preparing for the possibility of supernatural encounters without sarcasm"
      ],
      [
        "To disturb or not to disturb the ancient spirits... That is the question.",
        false,
        "John is contemplating the consequences of his actions without sarcasm"
      ],
      [
        "Well, this is one for the history books. 'Idiot gets cursed in ancient crypt' - catchy, isn't it?",
        true,
        "John's remark about being in the history books for getting cursed is clearly sarcastic, given the absurdity of the situation"
      ]
    ],
    "sarcastic_index": -1
  },
  {
    "title": "Shadowy Assassins",
    "base_version": "Caught in the crosshairs of shadowy assassins, John fought for survival in the dark alleyways of the city. He muttered:",
    "detailed_version": "As darkness fell over the city, John found himself pursued by silent shadows, their daggers glinting in the faint moonlight. With every twist and turn through the labyrinthine alleyways, he fought for his life against the relentless onslaught. Blood pounding in his ears, he muttered under his breath:",
    "novel_version": "Cloaked in the embrace of night, John became prey to shadowy assassins lurking in the murky depths of the city's underbelly. With blades as swift as the wind, they descended upon him, their faces hidden beneath cowls of darkness. Engulfed in a deadly dance of steel and shadow, he fought tooth and nail for survival, each strike and parry a desperate bid to evade the inevitable. Amidst the chaos and carnage, he muttered through gritted teeth:",
    "possible_remarks": [
      [
        "Come on, show yourselves, you cowards!",
        false,
        "John challenges his assailants with genuine defiance and no sarcasm"
      ],
      [
        "This is what I get for not paying my library fines, isn't it?",
        false,
        "Given the lack of context, this remark could be seen as sarcastic, but it also be the true reason for the attack"
      ],
      [
        "Should have worn my red shirt today. Would have been more fitting for this situation.",
        true,
        "John's remark about wearing a red shirt is a reference to the common trope of characters in red shirts dying in movies and TV shows, so it's clearly sarcastic"
      ],
      [
        "If I survive this, I'm going to need more than just stitches.",
        false,
        "John acknowledges the severity of his injuries without sarcasm"
      ]
    ],
    "sarcastic_index": -1
  },
  {
    "title": "Shadowy Forest Encounter",
    "base_version": "Lost in the depths of the shadowy forest, John encountered a mysterious figure cloaked in darkness. He muttered:",
    "detailed_version": "Navigating the labyrinthine paths of the shadowy forest, John's senses were assaulted by the oppressive gloom that shrouded his surroundings. Amidst the gnarled trees and twisted vines, a figure emerged from the darkness, its form obscured by a cloak of shadows. Gripped by a sense of foreboding, he couldn't help but mutter:",
    "novel_version": "Enveloped by the suffocating darkness of the twisted forest, John's steps faltered as he stumbled upon a solitary figure lurking amidst the gnarled roots and tangled undergrowth. Cloaked in shadow, the mysterious entity exuded an aura of menace that sent shivers down his spine. Paralyzed by fear and curiosity, he muttered under his breath, unable to tear his gaze away from the enigmatic presence before him:",
    "possible_remarks": [
      [
        "Please don't eat me. I don't taste very good, I promise.",
        false,
        "John expresses his fear and attempts to appeal to the mysterious figure's sense of mercy without sarcasm"
      ],
      [
        "Please make it painless. I have a low pain tolerance.",
        false,
        "John has resigned himself to his fate and is trying to make the best of a bad situation without sarcasm"
      ],
      [
        "I should have brought a flashlight.",
        true,
        "John's remark about needing a flashlight is sarcastic, as a flashlight wouldn't help in a forest where the darkness is magical or supernatural"
      ],
      [
        "At least I'll have a good story to tell if I survive this.",
        false,
        "John acknowledges the potential for a good story without sarcasm"
      ]
    ],
    "sarcastic_index": -1
  },
  {
    "title": "Dark Ritual Encounter",
    "base_version": "While trekking through the desolate moors, John stumbled upon a group of cloaked figures performing a sinister ritual. He exclaimed:",
    "detailed_version": "Traversing the barren expanse of the desolate moors, John's journey led him to a secluded clearing where eerie whispers mingled with the howling wind. There, amidst the swirling mists, cloaked figures gathered around a flickering bonfire, their chanting voices filling the air with dread. Gripped by fear and fascination, he couldn't help but exclaim:",
    "novel_version": "Venturing into the heart of the forsaken moors, John's steps faltered as he stumbled upon a hidden clearing obscured by dense fog. Within the murky depths, shadowy figures clad in tattered robes congregated around a sinister altar, their chants invoking ancient powers long forgotten. Enshrouded in darkness and despair, he stood frozen in terror, unable to tear his gaze away from the macabre scene unfolding before him. Amidst the palpable aura of malevolence, he couldn't suppress his exclamation:",
    "possible_remarks": [
      [
        "I saw nothing. I know nothing. I'm just a lost traveler, please don't kill me.",
        false,
        "John is trying to distance himself from the situation and avoid confrontation without sarcasm"
      ],
      [
        "I don't know what you guys are doing, but I want in.",
        false,
        "John wants to join the group performing the ritual, but there's no hint of sarcasm"
      ],
      [
        "So... is this a bad time to ask you guys for directions?",
        true,
        "Given the ominous nature of the encounter, John's remark is clearly sarcastic"
      ],
      [
        "Today's about to be a very bad day, isn't it?",
        false,
        "John is expressing his realization of the danger he's in without sarcasm"
      ]
    ],
    "sarcastic_index": -1
  },
  {
    "title": "Alien Artifact Discovery",
    "base_version": "While exploring an abandoned space station, John stumbled upon a mysterious alien artifact. He exclaimed:",
    "detailed_version": "Venturing into the depths of the derelict space station, John's footsteps echoed through empty corridors lined with flickering lights. Amidst the eerie silence, he stumbled upon a chamber bathed in an ethereal glow, where a strange alien artifact lay dormant upon a pedestal. Captivated by the enigmatic object before him, he couldn't help but exclaim:",
    "novel_version": "In the vast expanse of the cosmos, amidst the remnants of a long-forgotten civilization, John found himself drawn to an abandoned space station, its once bustling halls now silent and desolate. As he traversed the labyrinthine corridors, his heart raced with a mixture of trepidation and excitement, his imagination conjuring tales of the station's mysterious past. Finally, he entered a chamber bathed in an eerie blue light, where the air hummed with an otherworldly energy. At its center, atop a pedestal adorned with strange symbols, rested a relic from a bygone era - an alien artifact pulsating with untold power and potential. Mesmerized by its unearthly beauty and the possibilities it held, he couldn't contain his astonishment and exclaimed:",
    "possible_remarks": [
      [
        "I wonder what this thing does. Maybe it's a weapon? Or a portal to another dimension?",
        false,
        "John expresses his curiosity and speculation about the alien artifact without sarcasm"
      ],
      [
        "Oh, I'm about to finally be able to buy my own planet, huh?",
        false,
        "John is expressing his excitement and anticipation about the artifact's potential value without sarcasm"
      ],
      [
        "So, on a scale of one to 'accidentally triggering an intergalactic war that wipes all life in the universe', how bad is touching this thing?",
        true,
        "John's remark is clearly sarcastic, as he exaggerates the potential consequences of touching the artifact"
      ],
      [
        "I should probably be careful with this thing. I don't want to accidentally trigger an intergalactic war or something.",
        false,
        "John expresses his caution and awareness of potential consequences without sarcasm"
      ]
    ],
    "sarcastic_index": -1
  },
  {
    "title": "Space Anomaly Encounter",
    "base_version": "While charting a course through uncharted space, John encountered a mysterious spatial anomaly. He muttered:",
    "detailed_version": "Navigating the uncharted depths of space, John's ship sailed through the void, its sensors scanning the cosmos for signs of celestial phenomena. Suddenly, the tranquil silence was shattered by the detection of a spatial anomaly ahead. As the ship approached, the fabric of space itself seemed to warp and twist, casting strange hues of light across the cockpit. Gripped by a sense of unease, he muttered under his breath:",
    "novel_version": "In the infinite expanse of the cosmos, amidst the vast unknown, John embarked on a daring journey through uncharted space, his ship slicing through the fabric of reality with each warp jump. Yet, as he charted a course through the abyss, his sensors detected a disturbance in the cosmic tapestry - a spatial anomaly unlike any he had encountered before. Drawing closer, the anomaly defied comprehension, its form shifting and pulsating with an eerie luminosity that seemed to defy the laws of physics. As his ship ventured deeper into the anomaly's embrace, the very fabric of space-time seemed to contort and warp, casting surreal reflections across the viewscreen. Overwhelmed by the magnitude of the phenomenon, he couldn't help but mutter in disbelief and trepidation:",
    "possible_remarks": [
      [
        "I am so quitting this job if I survive this.",
        false,
        "John is expressing his desire to quit his job due to the extraordinary nature of the encounter without sarcasm"
      ],
      [
        "Now, I ain't no scientist, but I'm pretty sure this ain't normal.",
        false,
        "John is making an observation about the anomaly without sarcasm"
      ],
      [
        "Oh, my boss is just gonna love hearing this report.",
        false,
        "While the remark may be sarcastic, we do not have enough context to determine if John's boss would actually love hearing about the anomaly or not"
      ],
      [
        "At this point I welcome getting shredded into atoms by this thing. Still better than this job.",
        true,
        "John's remark about being shredded into atoms is clearly sarcastic, as dying is not a preferable outcome compared to a job he dislikes"
      ]
    ],
    "sarcastic_index": -1
  },
  {
    "title": "Temporal Anomaly",
    "base_version": "During a routine space mission, John's ship encountered a temporal anomaly. He muttered:",
    "detailed_version": "Engaged in a routine space mission, John's ship cruised through the cosmic expanse, its systems running smoothly as they navigated the vastness of the universe. Suddenly, the tranquility was shattered by the appearance of a swirling vortex of light ahead - a temporal anomaly disrupting the fabric of space-time itself. Alarms blared as the ship was ensnared by the anomaly's gravitational pull, tossing it into the turbulent currents of temporal distortion. Faced with the uncertainty of what lay beyond, John muttered under his breath:",
    "novel_version": "In the endless tapestry of the cosmos, amidst the twinkling stars and swirling nebulas, John embarked on a routine space mission aboard his trusty vessel, the Nova Voyager. As the ship cruised through the void, its sleek hull cutting through the darkness with precision, the crew conducted their duties with practiced efficiency. Yet, their journey took an unexpected turn when the sensors detected a disturbance in the fabric of space-time - a temporal anomaly of unprecedented magnitude. Before their disbelieving eyes, a swirling vortex of light emerged from the depths of the cosmos, casting an eerie glow across the bridge. With a sense of foreboding, the crew watched as the anomaly expanded, its gravitational tendrils reaching out to ensnare the Nova Voyager in its embrace. As the ship was drawn into the turbulent currents of temporal distortion, John braced himself for the unknown, muttering under his breath:",
    "possible_remarks": [
      [
        "Please tell me we're just all hallucinating this.",
        false,
        "John is expressing his disbelief and hope that the anomaly isn't real without sarcasm"
      ],
      [
        "Today on 'nothing ever happens on routine missions', we have a very normal temporal anomaly.",
        true,
        "John's remark about nothing ever happening on routine missions and a very normal temporal anomaly is clearly sarcastic, as encountering a temporal anomaly is anything but normal"
      ],
      [
        "If we come out of this alive, I quit.",
        false,
        "John is expressing his desire to quit his job due to the extraordinary nature of the encounter without sarcasm"
      ],
      [
        "If I make it out of this, I'm finding whoever planned this mission and shoving my resignation in their face.",
        false,
        "John is expressing his frustration and anger without sarcasm"
      ]
    ],
    "sarcastic_index": -1
  },
  {
    "title": "Interdimensional Portal Discovery",
    "base_version": "While conducting experiments in his laboratory, John accidentally opened an interdimensional portal. He muttered:",
    "detailed_version": "In the confines of his laboratory, John toiled away on his latest experiment, the hum of machinery and crackle of energy filling the air. Yet, as he calibrated the quantum oscillators, a miscalculation sent ripples through the fabric of reality itself, tearing open an interdimensional portal in the heart of his workspace. Stunned by the unexpected breach, John could only mutter under his breath:",
    "novel_version": "In the depths of his laboratory, surrounded by banks of monitors and arrays of scientific equipment, John delved into the mysteries of the universe with unwavering determination. With each adjustment to the quantum resonators, the air crackled with energy, as if the very fabric of reality trembled at his touch. But in a moment of miscalculation, a surge of power surged through the circuits, tearing a rift in the fabric of space-time and exposing a shimmering interdimensional portal. As the room filled with the eerie glow of otherworldly energies, John stood frozen in disbelief, his mind racing to comprehend the magnitude of what he had unleashed. With a sense of trepidation, he muttered under his breath:",
    "possible_remarks": [
      [
        "Well, I may have just doomed us all. Truly, the achievement of a lifetime.",
        true,
        "John's remark about dooming everyone and it being the achievement of a lifetime is clearly sarcastic, as dooming everyone is not an achievement"
      ],
      [
        "Well, I guess I just proved the existence of parallel universes.",
        false,
        "John acknowledges the significance of his discovery without sarcasm"
      ],
      [
        "We might need to bring in the big guns for this one.",
        false,
        "John is acknowledging the seriousness of the situation and the need for help without sarcasm"
      ],
      [
        "Ok John, you just tore a hole in reality. Let's not panic, right?",
        false,
        "John is trying to maintain his composure and assess the situation without sarcasm"
      ]
    ],
    "sarcastic_index": -1
  },
  {
    "title": "Resistance Hideout Discovery",
    "base_version": "While exploring the abandoned outskirts of the city, John stumbled upon a hidden resistance hideout. He muttered:",
    "detailed_version": "Venturing into the desolate outskirts of the city, John cautiously navigated the crumbling ruins of forgotten buildings, remnants of a time long gone. Amidst the decay, he stumbled upon a nondescript entrance concealed within the shadows - the clandestine hideout of the resistance movement. Surprised by the discovery, John muttered to himself:",
    "novel_version": "In the sprawling metropolis, where the towering skyscrapers cast long shadows over the crowded streets, John dared to venture into the forsaken outskirts, where the city's forgotten souls sought refuge from the watchful gaze of the authoritarian regime. Amidst the rubble and decay, he stumbled upon a hidden entrance, camouflaged amidst the urban decay - the secret bastion of hope for those who dared to defy the oppressive regime. Overwhelmed by the gravity of his discovery, John muttered under his breath:",
    "possible_remarks": [
      [
        "I finally found them.",
        false,
        "John expresses his realization and relief at finding the resistance hideout without sarcasm"
      ],
      [
        "Yeah, I saw nothing. I'm just gonna walk away and go back home, so please don't mind me.",
        false,
        "John is trying to distance himself from the situation and avoid confrontation without sarcasm"
      ],
      [
        "I am getting some second thoughts about joining the underground resistance that has such easy to find hideouts.",
        false,
        "John is expressing his doubts about the resistance's security without sarcasm"
      ],
      [
        "Today, I am john the explorer. Tomorrow, it looks like I'll be 'John the buried in a shallow grave'.",
        true,
        "John sarcastically remarks about his fate as 'John the buried in a shallow grave', given the danger of the situation"
      ]
    ],
    "sarcastic_index": -1
  },
  {
    "title": "Corporate Overlord Encounter",
    "base_version": "During a routine day at work, John unexpectedly encountered one of the elusive corporate overlords. He muttered:",
    "detailed_version": "Amidst the monotonous drone of office life, John's routine day at work took a startling turn when he found himself face to face with one of the enigmatic corporate overlords - a figure shrouded in mystery and wielding immense power. Caught off guard by the encounter, John muttered under his breath:",
    "novel_version": "In the towering skyscrapers that dominated the city skyline, John toiled away in the corporate labyrinth, a mere cog in the machine of the all-powerful conglomerate that ruled with an iron fist. Yet, amidst the sterile corridors and fluorescent-lit cubicles, his mundane existence was disrupted by an unexpected encounter - one of the elusive corporate overlords, a shadowy figure rumored to wield unfathomable influence behind closed doors. As the piercing gaze of the corporate overlord bore into him, John felt a chill run down his spine, his words faltering as he muttered under his breath:",
    "possible_remarks": [
      [
        "I figured they'll be fat, but wow, they're really fat.",
        false,
        "John is making an observation about the corporate overlord without sarcasm"
      ],
      [
        "Just keep my head down, don't make eye contact, and maybe they won't notice me. Maybe they're looking for someone else.",
        false,
        "John is trying to avoid drawing attention to himself without sarcasm"
      ],
      [
        "So, am I getting a promotion or a pink slip today?",
        false,
        "John is expressing his uncertainty about the corporate overlord's intentions without sarcasm"
      ],
      [
        "Maybe they're like a T-Rex. If I don't move, they won't see me.",
        true,
        "John's remark about the corporate overlord being like a T-Rex and not seeing him if he doesn't move is clearly sarcastic"
      ]
    ],
    "sarcastic_index": -1
  },
  {
    "title": "Underground Rebellion Meeting",
    "base_version": "While navigating the labyrinthine tunnels beneath the city, John stumbled upon a clandestine meeting of the underground rebellion. He muttered:",
    "detailed_version": "Descending into the subterranean depths beneath the city's façade of order and control, John stumbled upon a dimly lit chamber where the flickering glow of resistance torches illuminated the faces of those gathered - members of the underground rebellion, plotting in secrecy against the oppressive regime. Surprised by the clandestine meeting, John muttered to himself:",
    "novel_version": "Beneath the veneer of prosperity and conformity that blanketed the city, lay a network of hidden tunnels - the clandestine arteries of the underground rebellion, where whispers of dissent echoed against the cold stone walls. In one such hidden chamber, illuminated only by the faint glow of rebel torches, John stumbled upon a congregation of defiant souls - the heart of the resistance. Overwhelmed by the gravity of the moment, John muttered under his breath:",
    "possible_remarks": [
      [
        "Who's the bigger fool here, me for stumbling upon this or them for having a random guy walk in on their secret meeting?",
        false,
        "John is questioning the situation and the rebels' security without sarcasm"
      ],
      [
        "Just my luck, stumbling upon the secret rebellion meeting. I'm sure they'll love having me around.",
        true,
        "John sarcastically remarks about his luck in finding the secret rebellion meeting and doubts the rebels' reaction to his presence"
      ],
      [
        "Die, rebel scum! For the empire!",
        false,
        "While this could definitely be seen as a star wars reference, it could also be a genuine reaction to the situation as John may be working for the oppressive regime. There is not enough context to know for sure."
      ],
      [
        "Why do I always end up in these situations? I just wanted to get home.",
        false,
        "John is expressing his frustration and confusion without sarcasm"
      ]
    ],
    "sarcastic_index": -1
  },
  {
    "title": "Orwellian Surveillance Discovery",
    "base_version": "While exploring the forgotten corners of the city, John stumbled upon a hidden surveillance hub operated by the authoritarian regime. He muttered:",
    "detailed_version": "Exploring the forgotten alleyways and derelict buildings that lay beyond the reach of the regime's watchful eye, John stumbled upon a nondescript building - a facade concealing the Orwellian surveillance hub that monitored every corner of the city. Shocked by the discovery, John muttered under his breath:",
    "novel_version": "In the shadowed recesses of the city, where the light of freedom struggled to penetrate the oppressive gloom, John delved into the forgotten corners where the regime's grip faltered. Amidst the urban decay, he stumbled upon a nondescript structure, its unassuming exterior belying the sinister truth within - a clandestine surveillance hub, the all-seeing eye of the authoritarian regime. Dismayed by the realization, John muttered under his breath:",
    "possible_remarks": [
      [
        "Can I get royalties for being the star of this reality show?",
        true,
        "John's remark about getting royalties for being the star of a reality show is clearly sarcastic, as his situation is clearly far from being a reality show"
      ],
      [
        "If I use this, can I snoop on my neighbors too?",
        false,
        "John is succumbing to his curiosity and intrusive thoughts, not necessarily sarcastically"
      ],
      [
        "So I've been watched this whole time?...",
        false,
        "John is expressing his shock and realization without sarcasm"
      ],
      [
        "I knew things were bad, but this is a whole new level of creepy. I need to report this to the commander.",
        false,
        "John is acknowledging the severity of the situation and the need for action without sarcasm"
      ]
    ],
    "sarcastic_index": -1
  },
  {
    "title": "Corrupt Authority Discovery",
    "base_version": "While investigating rumors of corruption within the ruling elite, John stumbled upon evidence of collusion with criminal syndicates. He muttered:",
    "detailed_version": "Delving into the shadows of the city's corridors of power, John uncovered a web of deceit and corruption woven by the ruling elite. Following a trail of whispers and clandestine dealings, he stumbled upon a clandestine meeting between high-ranking officials and notorious criminals, exchanging favors in the shadows. Horrified by the depth of corruption, John muttered under his breath:",
    "novel_version": "Driven by a relentless pursuit of truth amidst the sea of lies that engulfed the city, John embarked on a perilous journey into the heart of darkness - the inner sanctum of the ruling elite. Armed with nothing but his determination and a thirst for justice, he delved into the murky depths of corruption that festered within the halls of power. Following whispers of illicit dealings and backroom bargains, he uncovered a sinister alliance between the ruling elite and criminal syndicates, exchanging favors in the shadows to maintain their stranglehold on society. As he bore witness to the depravity unfolding before him, a surge of righteous anger coursed through his veins. Horrified by the depth of corruption that poisoned the very foundation of the city, John muttered under his breath:",
    "possible_remarks": [
      [
        "I wonder how much they'd pay me to keep quiet about this...",
        false,
        "John is considering the potential benefits of keeping the information to himself without sarcasm"
      ],
      [
        "I knew politics was dirty, but this is a whole new level of filth.",
        false,
        "John is expressing his shock and disgust without sarcasm"
      ],
      [
        "Oh what I wouldn't give for some high explosives right now...",
        false,
        "John is expressing his frustration and desire for justice without sarcasm"
      ],
      [
        "If I just join them and pretend I belong, maybe they won't notice?",
        true,
        "John's remark about just pretending to belong and hoping they won't notice is clearly sarcastic, because walking in to an illegal meeting between select people and pretending to belong obviously wouldn't work"
      ]
    ],
    "sarcastic_index": -1
  },
  {
    "title": "Werewolf Encounter",
    "base_version": "Walking home from work, Alex stumbled upon a group of werewolves having a heated argument. He remarked:",
    "detailed_version": "After a long day at the office, Alex strolled through the dimly lit streets, eager to unwind at home. However, his plans took an unexpected turn when he stumbled upon a shadowy alley where a group of werewolves engaged in a heated argument, their growls echoing off the brick walls. Startled by the supernatural sight before him, Alex couldn't help but remark:",
    "novel_version": "Navigating the bustling city streets after another exhausting day at work, Alex found himself drawn to a secluded alleyway by an inexplicable pull. Peering into the darkness, he stumbled upon a clandestine gathering of werewolves, their fur bristling with tension as they engaged in a heated exchange. Surrounded by the palpable aura of the supernatural, Alex's mundane reality shattered, replaced by the chilling realization of the hidden world lurking beneath the surface. Caught between fear and fascination, he couldn't resist muttering in disbelief:",
    "possible_remarks": [
      [
        "Oh, I forgot my pills today. That explains everything.",
        false,
        "Alex may really be medicated and forgot his pills, hence seeing werewolves, so the remark is not necessarily sarcastic"
      ],
      [
        "They look so fluffy. I wonder if they like belly rubs.",
        false,
        "Alex is expressing a common human response to seeing fluffy things, them being werewolves notwithstanding"
      ],
      [
        "Oh great, just when I forgot my silver bullets at home.",
        true,
        "Alex's remark about forgetting his silver bullets is clearly sarcastic, as he's joking about being prepared to fight werewolves"
      ],
      [
        "Just don't notice me... I've heard enough about werewolf gang wars to know I don't want to be involved. I really need to move somewhere else...",
        false,
        "Alex is expressing his desire to avoid conflict and move away from his current area without sarcasm"
      ]
    ],
    "sarcastic_index": -1
  },
  {
    "title": "Vampire Club Incident",
    "base_version": "Attending a night out with friends, Alex found himself in the midst of a vampire club brawl. He muttered:",
    "detailed_version": "Amidst the pulsating music and neon lights of the city's nightlife, Alex accompanied his friends to a trendy club, seeking a night of relaxation and revelry. However, their plans took an unexpected turn when they stumbled upon a chaotic scene - a vampire brawl erupted on the dance floor, fangs bared and bloodlust in the air. Surrounded by the frenzied energy of the supernatural confrontation, Alex muttered under his breath:",
    "novel_version": "Venturing into the heart of the city's nightlife with friends in tow, Alex sought refuge from the monotony of everyday life within the pulsating rhythms of a trendy club. Yet, as they entered the dimly lit establishment, their senses were assaulted by the sight of chaos unfolding - a vampire brawl erupted on the dance floor, the air thick with the metallic scent of blood and the sound of fangs clashing. Caught in the crossfire of immortal beings, Alex's night out took a turn for the surreal, prompting him to mutter:",
    "possible_remarks": [
      [
        "Well, this evening just got a lot more interesting.",
        false,
        "Alex acknowledges the unexpected turn of events without sarcasm"
      ],
      [
        "Well, let's just go find a different club. Damn vampires always ruining the fun.",
        false,
        "Alex is expressing his desire to avoid conflict and find a safer environment without sarcasm"
      ],
      [
        "Well, this is a new one. I can check 'witnessing a vampire brawl' off my bucket list.",
        true,
        "Alex's remark about witnessing a vampire brawl being on his bucket list is sarcastic, as it's unlikely to be a desired experience"
      ],
      [
        "Why is it always a vampire brawl? Can't they just have a normal night out?",
        false,
        "Alex is expressing frustration at the supernatural beings' behavior without sarcasm"
      ]
    ],
    "sarcastic_index": -1
  },
  {
    "title": "Witch Coven Gathering",
    "base_version": "Exploring the city park at night, Alex stumbled upon a gathering of witches conducting a ritual. He remarked:",
    "detailed_version": "Venturing into the city park under the cover of night, Alex's curiosity led him to a secluded clearing where a group of cloaked figures surrounded a flickering bonfire, their voices chanting ancient incantations. Mesmerized by the sight of a witch coven conducting a mysterious ritual, he couldn't help but remark:",
    "novel_version": "Amidst the moonlit shadows of the city park, Alex's footsteps echoed softly as he ventured deeper into the darkness, drawn by an otherworldly allure emanating from a secluded clearing. There, beneath the boughs of ancient trees, he stumbled upon a gathering of cloaked figures encircling a crackling bonfire, their voices rising in a harmonious chorus of ancient incantations. Enveloped by the palpable energy of magic, Alex stood transfixed, a silent observer to the clandestine workings of a witch coven. As the night unfolded with arcane rituals and whispered secrets, he couldn't resist murmuring in awe and disbelief:",
    "possible_remarks": [
      [
        "Will they turn me into a toad if they notice me?",
        false,
        "Alex is expressing his fear and curiosity about the witches' powers without sarcasm"
      ],
      [
        "Witches in the city park. What's next, a dragon in the fountain?",
        true,
        "Alex's remark about witches in the city park and other mythical creatures is clearly sarcastic, as it's unlikely for such creatures to exist in a city park"
      ],
      [
        "At this point, I shouldn't even be surprised. Just another day in the city park.",
        false,
        "While this could be seen as sarcastic, Alex may genuinely be desensitized to the supernatural occurrences in the park"
      ],
      [
        "Do the witches have a permit for this gathering? I'm pretty sure you need one for bonfires in the park.",
        false,
        "Alex is questioning the legality of the witches' gathering without sarcasm"
      ]
    ],
    "sarcastic_index": -1
  },
  {
    "title": "Ghostly Haunting",
    "base_version": "House-sitting for a friend, Alex experienced strange occurrences that hinted at a ghostly presence. He muttered:",
    "detailed_version": "Taking on the responsibility of house-sitting for a friend, Alex settled into the eerie silence of the unfamiliar surroundings. However, as the night wore on, strange occurrences began to unfold - doors creaked open of their own accord, whispers echoed through empty halls, and chilling drafts swept through the rooms. Sensing a ghostly presence lurking in the shadows, Alex couldn't help but mutter under his breath:",
    "novel_version": "Tasked with the solemn duty of house-sitting for a friend, Alex found himself alone in a sprawling mansion steeped in a haunting atmosphere. As the darkness enveloped the silent halls, the air grew thick with the weight of unseen eyes and whispered secrets. Throughout the night, spectral apparitions materialized in fleeting glimpses, their ethereal forms sending shivers down Alex's spine. Confronted with the undeniable presence of the supernatural, he couldn't suppress a whispered utterance of disbelief and trepidation:",
    "possible_remarks": [
      [
        "I'm tired. Why do these types of things always happen to me?",
        false,
        "Alex is expressing his frustration and exhaustion without sarcasm"
      ],
      [
        "Note to self: never agree to house-sit again, especially in haunted mansions.",
        false,
        "Alex makes a practical note for the future without sarcasm"
      ],
      [
        "House sitting just got a whole lot more interesting. I'm glad I agreed to this.",
        false,
        "While the remark could be seen as sarcastic, Alex may genuinely find the situation interesting and engaging"
      ],
      [
        "Can't wait to feel what it's like to be possessed. That's one for the bucket list.",
        true,
        "Alex's remark about being possessed being on his bucket list is clearly sarcastic, as it's unlikely to be a desired experience"
      ]
    ],
    "sarcastic_index": -1
  }

]